org/_notes/2022-07-17-benchmarking-rocksdb.org
#+TITLE: 2022 07 17 Benchmarking Rocksdb
#+OPTIONS: toc:nil
#+BEGIN_EXPORT html
---
layout: post
title: "Benchmarking RocksDB"
short: "Notes related to Benchmarking RocksDB"
category: benchmarking
status: Stale
---
#+END_EXPORT

This page contains various notes related to benchmarking RocksDB.
RocksDB can be benchmarked with the help of db_bench. This is a tool made originally made by Google for LevelDB, but now altered for Meta's workload with RocksDB. As it closely matches the needs of Meta, it is a handy tool to use when you want to test a key-value store that is not production-ready yet or will not start with a large workload out of the box. For example if you intend to use RocksDB, there are quite a few different options to pick from, to see what works best db_bench can help significantly.

* !!!This page requires cleaning!!!

* Setup db_bench
db_bench should come along with the rest of the RocksDB repository. By using CMake it should be possible to only issue one build command and all of db_bench dependencies will be built as well. Do ensure that is run in release mode. An example command would be:

#+BEGIN_SRC bash
mkdir build
cd build
cmake -DCMAKE_BUILD_TYPE=Release ..
make -j $nprocs db_bench
#+END_SRC

If you prefer UNIX Makefiles, do:
#+BEGIN_SRC bash
DEBUG_LEVEL=0 make -j $nprocs db_bench
#+END_SRC

** Gflags
RocksDB tools such as db_bench depend on Gflags to be installed. This is leads to problems when you do not want to globally install Gflags (why would you?).
To solve this, you need to clone Gflags, install it to a custom directory, and change some variables in the build variables used for RocksDB.
#+BEGIN_SRC bash
git clone https://github.com/gflags/gflags.git
git checkout v2.0
./configure --prefix=<prefix_dir>
make
make install
#+END_SRC
If for any chance you installed the wrong version, you might need to cleanup manually.
Remove the directory `prefix_dir/include/gflags` and all `gflags` .a and .so files in `prefix_dir/lib/`.

Then built db_bench. For CMake set (e.g. ccmake) `GFLAGS_INCLUDE_DIR` to `prefix_dir/include/gflags` and `GFLAGS_LIBRARIES` to `prefix_dir/lib/libgflags.a` (so use the static one).
For the Unix Makefile, the following seems to work:
#+BEGIN_SRC bash
make clean # Always clean before rebuilding!
PKG_CONFIG_PATH="$PKG_CONFIG_PATH:<prefix_dir>/lib/pkgconfig" CFLAGS="-I <prefix_dir>/include/gflags/ -DGFLAGS=google" LDFLAGS="<prefix_dir>/lib/libgflags.a" <OTHER_VARS> make db_bench
#+END_SRC


** Improve histogram to show more information

db_bench has an option known as --histogram. This option is great for general analysis, but misses a lot of information. For example, when creating a box plot you also want the P25, which is not available by default. It is also hard to measure tail latency, as P99.99 is not enough. This can (at the moment) be altered as follows:

#+BEGIN_SRC bash
cd rocksdb
vi ./monitoring/histogram.cc
# navigate with a search function to a line containing "99."
# add the percentiles you need. E.g. "P25 %.2f" at the beginning and add Percentile(25) as first argument
make -j db_bench
#+END_SRC

* Interesting workloads
db_bench comes with a lot of different benchmarks. It is possible to do multiple, by using "," in the argument. For example benchmarks="fillseq,fillrandom". Some benchmarks that I find interesting to test the underlying storage:

- fillseq: fills key-value pairs in sequential order. Ideal to test a key-value store in alpha stage and to test random vs non-random I/O.
- fillrandom: fills key-value pairs in random order. Some keys MIGHT occur multiple times, requiring overwrite functionality.
    overwrite: keeps overwriting a set of the same keys. This is a good stress test. Especially to test garbage collection of the LSM-tree.
- readwhilewriting: tests resource contention. It uses x readers that all try to read, while another process keeps writing. It can be used to test for excessive locking and scaling issues.
- stats: returns the stats of the last run.


