_notes/2022-07-17-benchmarking-rocksdb.html
---
layout: post
title: "Benchmarking RocksDB"
short: "Notes related to Benchmarking RocksDB"
category: benchmarking
status: Stale
---

<p>
This page contains various notes related to benchmarking RocksDB.
RocksDB can be benchmarked with the help of db<sub>bench</sub>. This is a tool made originally made by Google for LevelDB, but now altered for Meta&rsquo;s workload with RocksDB. As it closely matches the needs of Meta, it is a handy tool to use when you want to test a key-value store that is not production-ready yet or will not start with a large workload out of the box. For example if you intend to use RocksDB, there are quite a few different options to pick from, to see what works best db<sub>bench</sub> can help significantly.
</p>

<div id="outline-container-orgeb578d6" class="outline-2">
<h2 id="orgeb578d6"><span class="section-number-2">1.</span> !!!This page requires cleaning!!!</h2>
</div>

<div id="outline-container-orgab83082" class="outline-2">
<h2 id="orgab83082"><span class="section-number-2">2.</span> Setup db<sub>bench</sub></h2>
<div class="outline-text-2" id="text-2">
<p>
db<sub>bench</sub> should come along with the rest of the RocksDB repository. By using CMake it should be possible to only issue one build command and all of db<sub>bench</sub> dependencies will be built as well. Do ensure that is run in release mode. An example command would be:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fabd2f;">mkdir</span> build
<span style="color: #fabd2f;">cd</span> build
cmake -DCMAKE_BUILD_TYPE=Release ..
<span style="color: #fabd2f;">make</span> -j $<span style="color: #83a598;">nprocs</span> db_bench
</pre>
</div>

<p>
If you prefer UNIX Makefiles, do:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #83a598;">DEBUG_LEVEL</span>=<span style="color: #d3869b; font-weight: bold;">0</span> <span style="color: #fabd2f;">make</span> -j $<span style="color: #83a598;">nprocs</span> db_bench
</pre>
</div>
</div>

<div id="outline-container-org8a8d057" class="outline-3">
<h3 id="org8a8d057"><span class="section-number-3">2.1.</span> Gflags</h3>
<div class="outline-text-3" id="text-2-1">
<p>
RocksDB tools such as db<sub>bench</sub> depend on Gflags to be installed. This is leads to problems when you do not want to globally install Gflags (why would you?).
To solve this, you need to clone Gflags, install it to a custom directory, and change some variables in the build variables used for RocksDB.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fabd2f;">git</span> clone https://github.com/gflags/gflags.git
<span style="color: #fabd2f;">git</span> checkout v2.0
./configure --prefix=&lt;prefix_dir&gt;
<span style="color: #fabd2f;">make</span>
<span style="color: #fabd2f;">make</span> install
</pre>
</div>
<p>
If for any chance you installed the wrong version, you might need to cleanup manually.
Remove the directory `prefix<sub>dir</sub>/include/gflags` and all `gflags` .a and .so files in `prefix<sub>dir</sub>/lib/`.
</p>

<p>
Then built db<sub>bench</sub>. For CMake set (e.g. ccmake) `GFLAGS<sub>INCLUDE</sub><sub>DIR</sub>` to `prefix<sub>dir</sub>/include/gflags` and `GFLAGS<sub>LIBRARIES</sub>` to `prefix<sub>dir</sub>/lib/libgflags.a` (so use the static one).
For the Unix Makefile, the following seems to work:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fabd2f;">make</span> clean <span style="color: #928374;"># </span><span style="color: #928374;">Always clean before rebuilding!</span>
<span style="color: #83a598;">PKG_CONFIG_PATH</span>=<span style="color: #b8bb26;">"</span><span style="color: #d3869b;">$</span><span style="color: #83a598;">PKG_CONFIG_PATH</span><span style="color: #b8bb26;">:&lt;prefix_dir&gt;/lib/pkgconfig"</span> <span style="color: #83a598;">CFLAGS</span>=<span style="color: #b8bb26;">"-I &lt;prefix_dir&gt;/include/gflags/ -DGFLAGS=google"</span> <span style="color: #83a598;">LDFLAGS</span>=<span style="color: #b8bb26;">"&lt;prefix_dir&gt;/lib/libgflags.a"</span> &lt;OTHER_VARS&gt; <span style="color: #fabd2f;">make</span> db_bench
</pre>
</div>
</div>
</div>


<div id="outline-container-org5d7aa25" class="outline-3">
<h3 id="org5d7aa25"><span class="section-number-3">2.2.</span> Improve histogram to show more information</h3>
<div class="outline-text-3" id="text-2-2">
<p>
db<sub>bench</sub> has an option known as &#x2013;histogram. This option is great for general analysis, but misses a lot of information. For example, when creating a box plot you also want the P25, which is not available by default. It is also hard to measure tail latency, as P99.99 is not enough. This can (at the moment) be altered as follows:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fabd2f;">cd</span> rocksdb
vi ./monitoring/histogram.cc
<span style="color: #928374;"># </span><span style="color: #928374;">navigate with a search function to a line containing "99."</span>
<span style="color: #928374;"># </span><span style="color: #928374;">add the percentiles you need. E.g. "P25 %.2f" at the beginning and add Percentile(25) as first argument</span>
<span style="color: #fabd2f;">make</span> -j db_bench
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org905337f" class="outline-2">
<h2 id="org905337f"><span class="section-number-2">3.</span> Interesting workloads</h2>
<div class="outline-text-2" id="text-3">
<p>
db<sub>bench</sub> comes with a lot of different benchmarks. It is possible to do multiple, by using &ldquo;,&rdquo; in the argument. For example benchmarks=&ldquo;fillseq,fillrandom&rdquo;. Some benchmarks that I find interesting to test the underlying storage:
</p>

<ul class="org-ul">
<li>fillseq: fills key-value pairs in sequential order. Ideal to test a key-value store in alpha stage and to test random vs non-random I/O.</li>
<li>fillrandom: fills key-value pairs in random order. Some keys MIGHT occur multiple times, requiring overwrite functionality.
overwrite: keeps overwriting a set of the same keys. This is a good stress test. Especially to test garbage collection of the LSM-tree.</li>
<li>readwhilewriting: tests resource contention. It uses x readers that all try to read, while another process keeps writing. It can be used to test for excessive locking and scaling issues.</li>
<li>stats: returns the stats of the last run.</li>
</ul>
</div>
</div>
