org/_notes/2022-07-17-benchmarking-rocksdb.org
* Interesting parameters
db_bench allows testing various configurations. A few that I use:

- num: number of key-value pairs. This is the parameter to set when testing for large I/O (e.g. TBs of data)
- value_size: sets the value_size in bytes for each key-value pair. Can be used to check how well the store performs with different types of data. Can also be interesting to check the relation between e.g. blocksize and kv-pair size.
- key_size: sets the key_size in bytes for a key-value pair. This is interesting for similar reasons as the value_size, but also because keys are used in the metadata of e.g. SSTables. When the key size becomes very large, so does the metadata that comes along with it. This can be used to test if the key-value store support large keys and what quantity.
- compression_type: set it to `none`` when you do not want compression.
- write_buffer_size: size of the buffer that is used for the memtable. The bigger it is set, the more will be kept in RAM and the less flushes are needed (albeit larger flushes are done in the end).
- target_file_size_base: the approximate size to use for files. This can be used to for example get SSTables to be approximately the size of an SSD zone.
- histogram: very important. Shows a histogram at the end of each benchmark, that represents latencies. This is a good tool to get tail latencies of the key-value store.
- use_direct_reads: uses direct I/O for reads. A good parameter to set when you want to test storage.
- use_direct_io_for_flush_and_compaction: uses direct I/O for background operations. A good parameter to set when you want to test storage.
- max_background_jobs: can be used to tweak the maximum amount of background jobs that can be active. These threads can be used by e.g. compaction or flush threads, but might interfere with each other or the client threads.
- max_bytes_for_level_multiplier: The difference in max bytes for each level. Can be used to tweak the step between levels.
- threads: dependent on the benchmark. Generally means the client threads. For example for write benchmarks, it refers to concurrent client writes.
- use_existing_db: if set will use an already existing db. Some benchmarks require an existing db, others requires a new db. This parameter is good to set if multiple benchmarks will be run in series and they should continue on a dirty state.
- enable_pipelined_write: allows writing to memtable and WAL concurrently (like a pipeline).
- unordered_write + two_write_queues: relaxed consistency constraints for more performance. Is mutually exclusive with enable_pipelined_write. It is possible for concurrent reads to read different things and snapshots are not consistent (MVCC), but you will always read what you have just written.

* Benchmark RocksDB with ZenFS
ZenFS is an alternative file system that can only be used within RocksDB. It is essentially a domain-specific filesystem. Further on, it only works with ZNS SSDs. However, as of July 2022 this is the state of the art for RocksDB on such devices. It is therefore tempting to compare against ZenFS when benchmarking on ZNS SSDs.
