_notes/2022-07-17-benchmarking-rocksdb.html


<div id="outline-container-orge84a65e" class="outline-2">
<h2 id="orge84a65e"><span class="section-number-2">4.</span> Interesting parameters</h2>
<div class="outline-text-2" id="text-4">
<p>
db<sub>bench</sub> allows testing various configurations. A few that I use:
</p>

<ul class="org-ul">
<li>num: number of key-value pairs. This is the parameter to set when testing for large I/O (e.g. TBs of data)</li>
<li>value<sub>size</sub>: sets the value<sub>size</sub> in bytes for each key-value pair. Can be used to check how well the store performs with different types of data. Can also be interesting to check the relation between e.g. blocksize and kv-pair size.</li>
<li>key<sub>size</sub>: sets the key<sub>size</sub> in bytes for a key-value pair. This is interesting for similar reasons as the value<sub>size</sub>, but also because keys are used in the metadata of e.g. SSTables. When the key size becomes very large, so does the metadata that comes along with it. This can be used to test if the key-value store support large keys and what quantity.</li>
<li>compression<sub>type</sub>: set it to `none`` when you do not want compression.</li>
<li>write<sub>buffer</sub><sub>size</sub>: size of the buffer that is used for the memtable. The bigger it is set, the more will be kept in RAM and the less flushes are needed (albeit larger flushes are done in the end).</li>
<li>target<sub>file</sub><sub>size</sub><sub>base</sub>: the approximate size to use for files. This can be used to for example get SSTables to be approximately the size of an SSD zone.</li>
<li>histogram: very important. Shows a histogram at the end of each benchmark, that represents latencies. This is a good tool to get tail latencies of the key-value store.</li>
<li>use<sub>direct</sub><sub>reads</sub>: uses direct I/O for reads. A good parameter to set when you want to test storage.</li>
<li>use<sub>direct</sub><sub>io</sub><sub>for</sub><sub>flush</sub><sub>and</sub><sub>compaction</sub>: uses direct I/O for background operations. A good parameter to set when you want to test storage.</li>
<li>max<sub>background</sub><sub>jobs</sub>: can be used to tweak the maximum amount of background jobs that can be active. These threads can be used by e.g. compaction or flush threads, but might interfere with each other or the client threads.</li>
<li>max<sub>bytes</sub><sub>for</sub><sub>level</sub><sub>multiplier</sub>: The difference in max bytes for each level. Can be used to tweak the step between levels.</li>
<li>threads: dependent on the benchmark. Generally means the client threads. For example for write benchmarks, it refers to concurrent client writes.</li>
<li>use<sub>existing</sub><sub>db</sub>: if set will use an already existing db. Some benchmarks require an existing db, others requires a new db. This parameter is good to set if multiple benchmarks will be run in series and they should continue on a dirty state.</li>
<li>enable<sub>pipelined</sub><sub>write</sub>: allows writing to memtable and WAL concurrently (like a pipeline).</li>
<li>unordered<sub>write</sub> + two<sub>write</sub><sub>queues</sub>: relaxed consistency constraints for more performance. Is mutually exclusive with enable<sub>pipelined</sub><sub>write</sub>. It is possible for concurrent reads to read different things and snapshots are not consistent (MVCC), but you will always read what you have just written.</li>
</ul>
</div>
</div>

<div id="outline-container-org116e8f9" class="outline-2">
<h2 id="org116e8f9"><span class="section-number-2">5.</span> Benchmark RocksDB with ZenFS</h2>
<div class="outline-text-2" id="text-5">
<p>
ZenFS is an alternative file system that can only be used within RocksDB. It is essentially a domain-specific filesystem. Further on, it only works with ZNS SSDs. However, as of July 2022 this is the state of the art for RocksDB on such devices. It is therefore tempting to compare against ZenFS when benchmarking on ZNS SSDs.
</p>
</div>
