org/_notes/2022-07-17-benchmarking-rocksdb.org
** Installing ZenFS
Using ZenFS does require some extra installations. It must be used as a plugin for RocksDB, which also requires rebuilding RocksDB yourself. So it is not possible to use RocksDB from a package repository! At https://github.com/westerndigitalcorporation/zenfs, it is explained how you can setup ZenFS. Nevertheless, as is always the case with rebuilding from source, things can go wrong. As far as I am aware WD (the company behind ZenFS) has no direct influence over the updates of RocksDB and the team that works on RocksDB has no direct influence over ZenFS. They are essentially separate projects. Therefore there might be versioning inconsistencies. Whenever working with ZenFS always verify that the both versions are compatible and if you benchmark, make sure that you are using a combination that is "optimal". Preferably pin a commit, use this commit in your benchmarks and report the commit SHA in your experiment details.

Below I highlight some issues that I came across when using ZenFS.

The first issue is related to LibZBD. This is a dependency of ZenFS. This library should be compiled and installed manually. See https://github.com/westerndigitalcorporation/libzbd. Be sure that ZenFS is compatible with the version of LibZBD.

If you get errors to `undefined reference to google:FlagRegisterer::Flag...`, something probably went wrong with your gflags installation (you should already have a gflags installed as otherwise RocksDB would not compile). A good guide to solve this issue is https://github.com/gflags/gflags/issues/203 the answer by EricOops is a life saver. EricOops recommends building and installing `gflags` and `glog` manually, which are a ZenFS dependency. However, do not forget to first purge the current gflags installations just to be sure.

Another issue has to do with the built system of ZenFS. ZenFS makes use of the plugin functionality of RocksDB. RocksDB supports plugins in both UNIX Makefiles and CMake, but there functionality differs significantly. For example the CMake plugins do not support custom scripts and do not install plugin header files on an install. Further on, if installing using the Makefile, package-config files will be created as well, while they are not when using CMake. ZenFS relies on all of these functionalities. This means that if you altered RocksDB and only use the CMakeList you have a problem. If possible only use the Makefile.

Else, consider if it is possible to benchmark RocksDB with another installation. One that use the same version, but without your changes.

If you need the changes, there is a hack to circumvent the issue, but it is not advisable. Generally it might break, but it is a good way to debug your system. Do NOT do this for benchmarking. In that case just use the Makefile.
1. Go to the zenfs directory and call `./generate-version.sh`. This would ordinarily be called from the Makefile, which we will not use.
2. Create a CMakeLists.txt in this directory. We are going to create a CMake plugin for ZenFS. Use something like (depending on the ZenFS version). Try to mimick ZenFS' Makefile:
#+BEGIN_SRC cmake
cmake_minimum_required(VERSION 3.4)

set(zenfs_SOURCES "fs/fs_zenfs.cc" "fs/zbd_zenfs.cc" "fs/io_zenfs.cc" PARENT_SCOPE)
set(zenfs_HEADER_DIR "fs" PARENT_SCOPE)
set(zenfs_CMAKE_EXE_LINKER_FLAGS "-u zenfs_filesystem_reg" PARENT_SCOPE)
set(zenfs_LIBS "zbd" PARENT_SCOPE)
#+END_SRC
3. Go to the RocksDB directory. Alter the CMakeList to support plugin headers being copied as well: Before the `foreach(plugin \${PLUGINS})` add `set(PLUGIN_HEADER_DIR "")` and in the loop add `list(APPEND PLUGIN_HEADER_DIR "plugin/${plugin}/\${
   \${plugin}_HEADER_DIR}")`. Then in the `install` section (such as at `install(TARGETS ${ROCKSDB_STATIC_LIB}` add:
   #+BEGIN_SRC cmake
foreach(header_dir ${PLUGIN_HEADER_DIR})
    install(DIRECTORY ${header_dir} COMPONENT devel DESTINATION "${CMAKE_INSTALL_INCLUDEDIR}/rocksdb/plugin/zenfs")
endforeach()
   #+END_SRC
4. Create a copy of the project, but without your changes. Built and install it with the Makefile and ZenFS and copy the .pc file to a secure installation.
5. Deinstall that project.
6. Remove the CMakeCache of your own project and rebuild the project with the ZenFS plugin enabled. Now copy the location of the earlier generated .pc file to your PKGCONFIG path and create the ZenFS filesystem as usual. In this scenario, you will use all the configs that you use within CMake, BUT you will create the filesystem with a fallback method.

** ZenFS Benchmarking
Then after ZenFS is up and running. We should be able to do benchmarking. First pick an appropriate ZNS SSD and use its name. Pick the name in `/dev/<name>` as ZenFS automatically uses `/dev/`. Then do the following to setup ZenFS:
#+BEGIN_SRC bash
# In all lines <dev> is the devicename
echo deadline | sudo tee "/sys/block/$dev/queue/scheduler" # ZenFS requires deadline as a scheduler
rm -rf /tmp/zenfs-aux # ZenFS requires a temporary LOG file, but it is not allowed to already exist!
cd $ZENFS_DIR # ZENFS_DIR should be the utils directory of ZenFS
./zenfs mkfs -zbd=$dev -aux_path=/tmp/zenfs-aux
#+END_SRC
When this succeeds, you should see a message such as: "ZenFS file system created. Free space: 3968745 MB". Otherwise, assume that it has failed.

Now benchmarks can be run on ZenFS. For some good examples go to https://github.com/westerndigitalcorporation/zenfs/tree/master/tests. In particular look at `get_good_db_bench_params_for_zenfs.sh`. What is immediately noticeable is that using ZenFS requires different db_bench commands. You should modify the fs_uri to point to the ZenFS filesystem with the arg `-fs_uri=zenfs://dev:$dev` with `dev` the device name. Then it should already work, but it is not optimal. In addition, we should set the target filesize to equal approximately the size of a zone. This size should then be used in the arg: `--target_file_size_base`. The write buffersize, set with `--write_buffer_size`, should also approximate this size.
** Remove ZenFS filesystem from a device
This is very easy as the ZenFS filesystem is never mounted. It runs in user space. So you do not have to do anything. If however, you want the ZNS SSD to go to a clean state, reset all zones with:
#+BEGIN_SRC bash
nvme zns reset-zone /dev/$dev -a
#+END_SRC

