_notes/2022-07-17-benchmarking-rocksdb.html
<div id="outline-container-org6b23a4f" class="outline-3">
<h3 id="org6b23a4f"><span class="section-number-3">5.1.</span> Installing ZenFS</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Using ZenFS does require some extra installations. It must be used as a plugin for RocksDB, which also requires rebuilding RocksDB yourself. So it is not possible to use RocksDB from a package repository! At <a href="https://github.com/westerndigitalcorporation/zenfs">https://github.com/westerndigitalcorporation/zenfs</a>, it is explained how you can setup ZenFS. Nevertheless, as is always the case with rebuilding from source, things can go wrong. As far as I am aware WD (the company behind ZenFS) has no direct influence over the updates of RocksDB and the team that works on RocksDB has no direct influence over ZenFS. They are essentially separate projects. Therefore there might be versioning inconsistencies. Whenever working with ZenFS always verify that the both versions are compatible and if you benchmark, make sure that you are using a combination that is &ldquo;optimal&rdquo;. Preferably pin a commit, use this commit in your benchmarks and report the commit SHA in your experiment details.
</p>

<p>
Below I highlight some issues that I came across when using ZenFS.
</p>

<p>
The first issue is related to LibZBD. This is a dependency of ZenFS. This library should be compiled and installed manually. See <a href="https://github.com/westerndigitalcorporation/libzbd">https://github.com/westerndigitalcorporation/libzbd</a>. Be sure that ZenFS is compatible with the version of LibZBD.
</p>

<p>
If you get errors to `undefined reference to google:FlagRegisterer::Flag&#x2026;`, something probably went wrong with your gflags installation (you should already have a gflags installed as otherwise RocksDB would not compile). A good guide to solve this issue is <a href="https://github.com/gflags/gflags/issues/203">https://github.com/gflags/gflags/issues/203</a> the answer by EricOops is a life saver. EricOops recommends building and installing `gflags` and `glog` manually, which are a ZenFS dependency. However, do not forget to first purge the current gflags installations just to be sure.
</p>

<p>
Another issue has to do with the built system of ZenFS. ZenFS makes use of the plugin functionality of RocksDB. RocksDB supports plugins in both UNIX Makefiles and CMake, but there functionality differs significantly. For example the CMake plugins do not support custom scripts and do not install plugin header files on an install. Further on, if installing using the Makefile, package-config files will be created as well, while they are not when using CMake. ZenFS relies on all of these functionalities. This means that if you altered RocksDB and only use the CMakeList you have a problem. If possible only use the Makefile.
</p>

<p>
Else, consider if it is possible to benchmark RocksDB with another installation. One that use the same version, but without your changes.
</p>

<p>
If you need the changes, there is a hack to circumvent the issue, but it is not advisable. Generally it might break, but it is a good way to debug your system. Do NOT do this for benchmarking. In that case just use the Makefile.
</p>
<ol class="org-ol">
<li>Go to the zenfs directory and call `./generate-version.sh`. This would ordinarily be called from the Makefile, which we will not use.</li>
<li>Create a CMakeLists.txt in this directory. We are going to create a CMake plugin for ZenFS. Use something like (depending on the ZenFS version). Try to mimick ZenFS&rsquo; Makefile:</li>
</ol>
<div class="org-src-container">
<pre class="src src-cmake"><span style="color: #b8bb26;">cmake_minimum_required</span>(VERSION <span style="color: #d3869b; font-weight: bold;">3.4</span>)

<span style="color: #b8bb26;">set</span>(zenfs_SOURCES <span style="color: #b8bb26;">"fs/fs_zenfs.cc"</span> <span style="color: #b8bb26;">"fs/zbd_zenfs.cc"</span> <span style="color: #b8bb26;">"fs/io_zenfs.cc"</span> PARENT_SCOPE)
<span style="color: #b8bb26;">set</span>(zenfs_HEADER_DIR <span style="color: #b8bb26;">"fs"</span> PARENT_SCOPE)
<span style="color: #b8bb26;">set</span>(zenfs_CMAKE_EXE_LINKER_FLAGS <span style="color: #b8bb26;">"-u zenfs_filesystem_reg"</span> PARENT_SCOPE)
<span style="color: #b8bb26;">set</span>(zenfs_LIBS <span style="color: #b8bb26;">"zbd"</span> PARENT_SCOPE)
</pre>
</div>
<ol class="org-ol">
<li><p>
Go to the RocksDB directory. Alter the CMakeList to support plugin headers being copied as well: Before the `foreach(plugin \\({PLUGINS})` add `set(PLUGIN_HEADER_DIR "")` and in the loop add `list(APPEND PLUGIN_HEADER_DIR "plugin/\){plugin}/\\({
   \\){plugin}<sub>HEADER</sub><sub>DIR</sub>}&ldquo;)`. Then in the `install` section (such as at `install(TARGETS ${ROCKSDB<sub>STATIC</sub><sub>LIB</sub>}` add:
</p>
<div class="org-src-container">
<pre class="src src-cmake"><span style="color: #fb4934;">foreach</span>(header_dir ${<span style="color: #83a598;">PLUGIN_HEADER_DIR</span>})
    <span style="color: #b8bb26;">install</span>(DIRECTORY ${<span style="color: #83a598;">header_dir</span>} COMPONENT devel DESTINATION <span style="color: #b8bb26;">"${</span><span style="color: #83a598;">CMAKE_INSTALL_INCLUDEDIR</span><span style="color: #b8bb26;">}/rocksdb/plugin/zenfs"</span>)
<span style="color: #fb4934;">endforeach</span>()
</pre>
</div></li>
<li>Create a copy of the project, but without your changes. Built and install it with the Makefile and ZenFS and copy the .pc file to a secure installation.</li>
<li>Deinstall that project.</li>
<li>Remove the CMakeCache of your own project and rebuild the project with the ZenFS plugin enabled. Now copy the location of the earlier generated .pc file to your PKGCONFIG path and create the ZenFS filesystem as usual. In this scenario, you will use all the configs that you use within CMake, BUT you will create the filesystem with a fallback method.</li>
</ol>
</div>
</div>

<div id="outline-container-org992faf4" class="outline-3">
<h3 id="org992faf4"><span class="section-number-3">5.2.</span> ZenFS Benchmarking</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Then after ZenFS is up and running. We should be able to do benchmarking. First pick an appropriate ZNS SSD and use its name. Pick the name in `/dev/&lt;name&gt;` as ZenFS automatically uses `/dev/`. Then do the following to setup ZenFS:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #928374;"># </span><span style="color: #928374;">In all lines &lt;dev&gt; is the devicename</span>
<span style="color: #fabd2f;">echo</span> deadline | <span style="color: #fabd2f;">sudo</span> tee <span style="color: #b8bb26;">"/sys/block/</span><span style="color: #d3869b;">$</span><span style="color: #83a598;">dev</span><span style="color: #b8bb26;">/queue/scheduler"</span> <span style="color: #928374;"># </span><span style="color: #928374;">ZenFS requires deadline as a scheduler</span>
<span style="color: #fabd2f;">rm</span> -rf /tmp/zenfs-aux <span style="color: #928374;"># </span><span style="color: #928374;">ZenFS requires a temporary LOG file, but it is not allowed to already exist!</span>
<span style="color: #fabd2f;">cd</span> $<span style="color: #83a598;">ZENFS_DIR</span> <span style="color: #928374;"># </span><span style="color: #928374;">ZENFS_DIR should be the utils directory of ZenFS</span>
./zenfs mkfs -zbd=$<span style="color: #83a598;">dev</span> -aux_path=/tmp/zenfs-aux
</pre>
</div>
<p>
When this succeeds, you should see a message such as: &ldquo;ZenFS file system created. Free space: 3968745 MB&rdquo;. Otherwise, assume that it has failed.
</p>

<p>
Now benchmarks can be run on ZenFS. For some good examples go to <a href="https://github.com/westerndigitalcorporation/zenfs/tree/master/tests">https://github.com/westerndigitalcorporation/zenfs/tree/master/tests</a>. In particular look at `get<sub>good</sub><sub>db</sub><sub>bench</sub><sub>params</sub><sub>for</sub><sub>zenfs.sh</sub>`. What is immediately noticeable is that using ZenFS requires different db<sub>bench</sub> commands. You should modify the fs<sub>uri</sub> to point to the ZenFS filesystem with the arg `-fs<sub>uri</sub>=zenfs://dev:$dev` with `dev` the device name. Then it should already work, but it is not optimal. In addition, we should set the target filesize to equal approximately the size of a zone. This size should then be used in the arg: `&#x2013;target<sub>file</sub><sub>size</sub><sub>base</sub>`. The write buffersize, set with `&#x2013;write<sub>buffer</sub><sub>size</sub>`, should also approximate this size.
</p>
</div>
</div>
<div id="outline-container-org08b7c2f" class="outline-3">
<h3 id="org08b7c2f"><span class="section-number-3">5.3.</span> Remove ZenFS filesystem from a device</h3>
<div class="outline-text-3" id="text-5-3">
<p>
This is very easy as the ZenFS filesystem is never mounted. It runs in user space. So you do not have to do anything. If however, you want the ZNS SSD to go to a clean state, reset all zones with:
</p>
<div class="org-src-container">
<pre class="src src-bash">nvme zns reset-zone /dev/$<span style="color: #83a598;">dev</span> -a
</pre>
</div>
</div>
</div>
</div>
