org/_notes/2022-07-17-benchmarking-rocksdb.org
* Benchmarking RocksDB with F2FS and ZNS SSDs
F2FS supports ZNS SSDs out of the box, provided a recent version of F2FS is used. However, it does require some additional setup and things to keep track of.The first idiosyncracy is that F2FS supports sequential zones for most of its data, except for at least a part of the metadata used. ZNS can support a few zones that can be written to randomly, but does not require to support them. Further on, such zones may not be enough to hold all metadata. Whenever the amount of randomly writable space is not enough, F2FS should warn you by default. For example, 100GB requires at least 4GB of random space and 7TB requires at least 16GB of random space. When the amount of space is not enough, we have to use an additional device as there is no other way. This does hinder benchmarks as F2FS "cheats" in this regard. To keep side-effects to a minimum, try to use a NVMe device with similar performance.

** Install F2FS
When using F2FS with F2fS-tools in 2022 and using the default kernel, ZNS is not supported by default. In that case, F2FS needs to be built manually. In this case, we have to be careful. Do NOT use the version on github as it does not seem to be maintained, instead clone from git://git.kernel.org/pub/scm/linux/kernel/git/jaegeuk/f2fs-tools.git. Then it should be as simple as following the instructions from the repo. One thing to be aware of is if you have all dependencies properly installed and set. During the configuration phase (`/configure.sh``) you should see a list of capabilities with "yes" or "no" next to it. If "blkzoned.capacity" is no, you can create a ZNS file system (at least the command completes without errors or warnings), but you can not actually use it... In this case, be sure you have a modern kernel, the headers are installed and the kernel is built with all of the required configs. In my case I had to also update a few libraries, such as BPF.
** Create the file system
To create the filesystem on ZNS, Nick Tehrany has an excellent paper on how to use F2FS on ZNS at https://arxiv.org/abs/2206.01547. First ensure that the ZNS device is actually empty! As at the moment (June 2022) F2FS makes no attempt to reset the device with for example:
#+BEGIN_SRC bash
nvme zns reset-zone /dev/$dev -a replace dev with the ZNS device and do this for every namespace used by the filesystem.
#+END_SRC
After this it is sufficient to say:
#+BEGIN_SRC bash
mkfs.f2fs -f -m -c /dev/$devzns /dev/$devnvme # With devzns the seq-only ZNS namespace of a ZNS device and devnvme the randomly write-able namespace of a ZNS device (or an other ordinary device)
#+END_SRC bash
Then mount the filesystem at the preferred mount point, such as /mnt/f2fs with:
#+BEGIN_SRC bash
mount -t f2fs /dev/$devnvme /mnt/f2fs # with devnvme the device the randomly writeable area defined in the previous command.
#+END_SRC
** Benchmarking wtih F2FS
Be sure to use the pointed mounted with F2FS only, by specifying the db and wal directory with setting `--db` and `--wal_dir` to be directories within the mounted filesystem.
