_notes/2022-07-17-benchmarking-rocksdb.html

<div id="outline-container-org9e4c341" class="outline-2">
<h2 id="org9e4c341"><span class="section-number-2">6.</span> Benchmarking RocksDB with F2FS and ZNS SSDs</h2>
<div class="outline-text-2" id="text-6">
<p>
F2FS supports ZNS SSDs out of the box, provided a recent version of F2FS is used. However, it does require some additional setup and things to keep track of.The first idiosyncracy is that F2FS supports sequential zones for most of its data, except for at least a part of the metadata used. ZNS can support a few zones that can be written to randomly, but does not require to support them. Further on, such zones may not be enough to hold all metadata. Whenever the amount of randomly writable space is not enough, F2FS should warn you by default. For example, 100GB requires at least 4GB of random space and 7TB requires at least 16GB of random space. When the amount of space is not enough, we have to use an additional device as there is no other way. This does hinder benchmarks as F2FS &ldquo;cheats&rdquo; in this regard. To keep side-effects to a minimum, try to use a NVMe device with similar performance.
</p>
</div>

<div id="outline-container-org5c56b7f" class="outline-3">
<h3 id="org5c56b7f"><span class="section-number-3">6.1.</span> Install F2FS</h3>
<div class="outline-text-3" id="text-6-1">
<p>
When using F2FS with F2fS-tools in 2022 and using the default kernel, ZNS is not supported by default. In that case, F2FS needs to be built manually. In this case, we have to be careful. Do NOT use the version on github as it does not seem to be maintained, instead clone from git://git.kernel.org/pub/scm/linux/kernel/git/jaegeuk/f2fs-tools.git. Then it should be as simple as following the instructions from the repo. One thing to be aware of is if you have all dependencies properly installed and set. During the configuration phase (`/configure.sh``) you should see a list of capabilities with &ldquo;yes&rdquo; or &ldquo;no&rdquo; next to it. If &ldquo;blkzoned.capacity&rdquo; is no, you can create a ZNS file system (at least the command completes without errors or warnings), but you can not actually use it&#x2026; In this case, be sure you have a modern kernel, the headers are installed and the kernel is built with all of the required configs. In my case I had to also update a few libraries, such as BPF.
</p>
</div>
</div>
<div id="outline-container-org546b8c5" class="outline-3">
<h3 id="org546b8c5"><span class="section-number-3">6.2.</span> Create the file system</h3>
<div class="outline-text-3" id="text-6-2">
<p>
To create the filesystem on ZNS, Nick Tehrany has an excellent paper on how to use F2FS on ZNS at <a href="https://arxiv.org/abs/2206.01547">https://arxiv.org/abs/2206.01547</a>. First ensure that the ZNS device is actually empty! As at the moment (June 2022) F2FS makes no attempt to reset the device with for example:
</p>
<div class="org-src-container">
<pre class="src src-bash">nvme zns reset-zone /dev/$<span style="color: #83a598;">dev</span> -a replace dev with the ZNS device and do this for every namespace used by the filesystem.
</pre>
</div>
<p>
After this it is sufficient to say:
</p>
<div class="org-src-container">
<pre class="src src-bash">mkfs.f2fs -f -m -c /dev/$<span style="color: #83a598;">devzns</span> /dev/$<span style="color: #83a598;">devnvme</span> <span style="color: #928374;"># </span><span style="color: #928374;">With devzns the seq-only ZNS namespace of a ZNS device and devnvme the randomly write-able namespace of a ZNS device (or an other ordinary device)</span>
<span style="color: #928374;">#</span><span style="color: #928374;">+END_SRC bash</span>
Then mount the filesystem at the preferred mount point, such as /mnt/f2fs with:
<span style="color: #928374;">#</span><span style="color: #928374;">+BEGIN_SRC bash</span>
mount -t f2fs /dev/$<span style="color: #83a598;">devnvme</span> /mnt/f2fs <span style="color: #928374;"># </span><span style="color: #928374;">with devnvme the device the randomly writeable area defined in the previous command.</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6529860" class="outline-3">
<h3 id="org6529860"><span class="section-number-3">6.3.</span> Benchmarking wtih F2FS</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Be sure to use the pointed mounted with F2FS only, by specifying the db and wal directory with setting `&#x2013;db` and `&#x2013;wal<sub>dir</sub>` to be directories within the mounted filesystem.
</p>
</div>
</div>
</div>
